In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_excel("https://data.hossam.kr/C02/pre_sample.xlsx", index_col='이름')
data=pd.DataFrame(df)

In [8]:
data.columns.difference(['학년', '성별'])

Index(['과학', '국어', '수학', '영어'], dtype='object')

방법 1

In [12]:
data["total"]=0
for col in data.columns.difference(['학년', '성별']):
    data["total"]+=data[col]

방법 2

In [17]:
data["sum"]=data[data.columns[2:6]].sum(axis=1)

In [ ]:
data.iloc[::-1]

In [23]:
data

    학년  성별  국어   영어  수학  과학  total  sum
이름
철수   1  남자  98   77  88  64    327  327
영희   2  여자  88  120  62  72    342  342
민철   1  남자  92   70  83  79    324  324
수현   3  여자  63   60  31  71    225  225
호영   4  남자  75   50  90  88    303  303
영호   4  남자  80   88  91  72    331  331
용식   2  남자  82   88  79  90    339  339
나영   1  여자  90   92  81  95    358  358
석영   1  남자  91   90  89  80    350  350

평균,분산,표준편차,최대최소

In [26]:
data.loc[:,data.columns[2:6]].mean(axis=1)

이름
철수    81.75
영희    85.50
민철    81.00
수현    56.25
호영    75.75
영호    82.75
용식    84.75
나영    89.50
석영    87.50
dtype: float64

In [28]:
data.loc[:,data.columns[2:6]].max(axis=1)

이름
철수     98
영희    120
민철     92
수현     71
호영     90
영호     91
용식     90
나영     95
석영     91
dtype: int64

In [29]:
data.loc[:,data.columns[2:6]].var(axis=1)

이름
철수    213.583333
영희    643.666667
민철     83.333333
수현    304.916667
호영    338.916667
영호     72.916667
용식     26.250000
나영     36.333333
석영     25.666667
dtype: float64

In [30]:
data.loc[:,data.columns[2:6]].std(axis=1)

이름
철수    14.614491
영희    25.370587
민철     9.128709
수현    17.461863
호영    18.409689
영호     8.539126
용식     5.123475
나영     6.027714
석영     5.066228
dtype: float64

Dataframe에 조건문 걸기

In [32]:
data["mean"]=data[data.columns[2:6]].mean(axis=1)
data.drop(columns=["total"],inplace=True)

In [36]:
data["Result"]=np.where(data["mean"]>=80,"Pass","Fail")

더 다양한 조건을 걸고싶다면?

In [41]:
select=[
    (data["mean"]>90),
    (data["mean"]>80),
    (data["mean"]>70)
]
value=["A","B","C"]

In [42]:
data["Score"]=np.select(select,value,default="F")

In [43]:
data

    학년  성별  국어   영어  수학  과학  sum   mean Result Score
이름
철수   1  남자  98   77  88  64  327  81.75   Pass     B
영희   2  여자  88  120  62  72  342  85.50   Pass     B
민철   1  남자  92   70  83  79  324  81.00   Pass     B
수현   3  여자  63   60  31  71  225  56.25   Fail     F
호영   4  남자  75   50  90  88  303  75.75   Fail     C
영호   4  남자  80   88  91  72  331  82.75   Pass     B
용식   2  남자  82   88  79  90  339  84.75   Pass     B
나영   1  여자  90   92  81  95  358  89.50   Pass     B
석영   1  남자  91   90  89  80  350  87.50   Pass     B